const a1 = ['a', 'a', 'a',"dsf"];
const a2 = ['d', 'e', 'f',["gg"]];
const a3 = [4,7,8,9,4];

console.log( a1.concat(a2)); 
// միավորում է զանգվածը առաջինի վերջից ավելացնելով երկերոդի սկիզբը։

console.log(a1.every((x)=> x == 'a')) 
//վերադարձնում է true եթե զանգավծի բոլոր էլ․ բավարարում են պայմանին հ․դ․ false

console.log( a1.filter(el => el.length <= 1));
//ստանում է ֆունկցիա և զանգվածից հանում այն էլեմենտը որի համար ֆունկցիան false է վերադարձրել true - ի դեպքում չի հեռացնում զանգվածից։

console.log(a2.flat(1));
// falt - ը ստանում է խորություն(որը ցույց է տալիս թե զանգվածի մեջ քանի խորությամբ զանգված կա) և հանում է զանգվածի էլեմենտները ըստ խորության։

a2.forEach(e => console.log(e));
// անցնում է զանգվածի ամեն էլեմենտի վրայով և կանչում callback ֆունկցիան

console.log(a1.indexOf('a'));
// վերադարձնում է փնտրվող էլ․ ինդեքս եթե չի գտնում վերադարձնում է -1։եթե նույն էլեմենտից 2 հատ կա վերադարձնում է առարին հանդիպածի ինդեքսը։ այս ֆունկցիան ստանում է երկրորդ արգումենտ որով որոշում է որ ինդեքսից սկսած որոնի։ 

console.log(a1.lastIndexOf('a'));
// սա նախորդ ֆունկցիայի նման է ուղակի վերջից սկսած է հաշվում։

console.log( a1.map(x => x + 2));
// այս ֆունկցիան վերադարձնում է նոր զանգված չփոխելով հինը։ նոր զանգվածի էլեմենտները callback ֆունկցիայի վերադարձրախ էլեմենտներն են։

console.log(a3.reduce(
  (ac, val) => ac + val,
));
//այս ֆունկցիան միավորում է բոլոր ելեմենտները callback ֆունկցիայի լոկիկայով

console.log( a1.reverse());
// այս ֆունկցիան շրջում է զանգվածը փոխելով իրականը։

console.log(a1.slice(2,3));
//այս ֆունկցիան կտրում է ըստ նշված միջակայքի եթե մեկ արգումենտ է փոխանցված ապա 0-ից մինչև այդ արգումենտը չներառյալ կհեռացնի եթե երկու արգումենտ է ստանում ապա [x , y)

console.log(a3.some((el) => el == 4));
// այս ֆունկցաին վերադարձնում է true եթե գոնե մեկ էլեմենտի համար callback ֆունկցիային վերադարձնում է true հ․դ false:  

console.log(a3.sort());
//սորտավորում է տրված զանգվածը։

console.log(a1.splice(1, 0, 'F'));
//այս ֆունկցիան իրական զանգվածում ավելեացնում է նշված էլեմենտը տրված ինդեքսով

const iterator1 = a1.entries();
console.log(iterator1.next());
//վերադարձնում է iterator որը ունի next ֆունկցիա որը վերադարձնում է object որը ունի 2 key done - true է երբ հասնում է զանգվածի վերջին, value - զանգված է որը պահում է ինֆորմացիա ինդեքսի և արժեքի մասին։

console.log(a1.fill(0, 2, 4));
// լցնում է զանգվածը առաջին արգումենտով նշված միջակայքով

console.log( a3.find(el => el < 10));
// զանգվածում փնտրում է callback ֆունկցիայում տրված պայմանի համաձայն

console.log( a3.findIndex(el => el < 10));
// այս ֆունկցիան նման է նախորդին բայց վերրադարձնում է ինդեքսը

console.log( a3.findLastIndex(el => el < 10));
// այս ֆունկցինա նման է նախորդին վերադարձնում է ինդեքսը վերջից սկսած

console.log(a3.includes(4));
// վերադարձնում է true եթե տրված արգումենտը կա զանգվածում հ․դ false

console.log(a1.join());
//միավորում է զանգվածի էլեմենտները և վերադարձնում string

console.log(a1.with(0, 5))
//առաջին պարամետրը դա ինդեքսն է երկրորդը արժեքը նշված ինդեքսով փոխում է զանգավծի էլեմենտը տրված արժեքով և վերադարձնում նոր զանգված չփոխելով հինը։


